maoravni/Dev/FEC/Common/3rdParty/umonm/umon_main/target/soc/kinetis/hal/sai/fsl_sai_hal.c
/*FUNCTION**********************************************************************
 *
 * Function Name : sai_hal_reset_tx
 * Description   : Reset tx according to reset mode.
 *The reset mode can be software reset and FIFO reset. 
 *END**************************************************************************/
void sai_hal_reset_tx(uint8_t instance, sai_reset_type_t mode)
{
    assert(instance < HW_I2S_INSTANCE_COUNT);
    uint32_t val = 0;
    switch (mode)
    {
        case kSaiResetTypeSoftware:
            BW_I2S_TCSR_SR(instance,1);
            break;
        case kSaiResetTypeFIFO:
            val = HW_I2S_TCSR_RD(instance);
            val |= I2S_TCSR_FR_MASK;
            HW_I2S_TCSR_WR(instance,val);
            break;
        default:
            break;
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : sai_hal_reset_rx
 * Description   : Reset rx according to reset mode.
 *The reset mode can be software reset and FIFO reset. 
 *END**************************************************************************/
void sai_hal_reset_rx(uint8_t instance, sai_reset_type_t mode)
{
    assert(instance < HW_I2S_INSTANCE_COUNT);
    uint32_t val = 0;
    switch (mode)
    {
        case kSaiResetTypeSoftware:
            BW_I2S_RCSR_SR(instance,1);
            break;
        case kSaiResetTypeFIFO:
            val = HW_I2S_TCSR_RD(instance);
            val |= I2S_TCSR_FR_MASK;
            HW_I2S_TCSR_WR(instance,val);
            break;
        default:
            break;
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : sai_hal_set_tx_mode
 * Description   : Set the work mode for tx.
 *The work mode have stop mode, debug mode and normal mode. 
 *END**************************************************************************/
void sai_hal_set_tx_mode(uint8_t instance, sai_mode_t mode)
{
    assert(instance < HW_I2S_INSTANCE_COUNT);
    switch (mode)
    {
        case kSaiRunModeStop:
            BW_I2S_TCSR_STOPE(instance,1);/* Stop mode */
            break;
        case kSaiRunModeDebug:
            BW_I2S_TCSR_DBGE(instance,1);/* Debug mode */
            break;
        default:
            break;
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : sai_hal_set_rx_mode
 * Description   : Set the work mode for rx.
 *The work mode have stop mode, debug mode and normal mode. 
 *END**************************************************************************/
void sai_hal_set_rx_mode(uint8_t instance, sai_mode_t mode)
{
    assert(instance < HW_I2S_INSTANCE_COUNT);
    switch (mode)
    {
        case kSaiRunModeStop:
            BW_I2S_RCSR_STOPE(instance,1);
            break;
        case kSaiRunModeDebug:
            BW_I2S_RCSR_DBGE(instance,1);
            break;
        default:
            break;
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : sai_hal_set_tx_bclk_swap
 * Description   : Swap the tx bit clock.
 *If the user want to swap the bit clock, just set bool variable to true. 
 *END**************************************************************************/
void sai_hal_set_tx_bclk_swap(uint8_t instance, bool ifswap)
{
    assert(instance < HW_I2S_INSTANCE_COUNT);
    if (ifswap)/* Swap the bit clock */
    {
        BW_I2S_TCR2_BCS(instance,1);
    }
    else
    {
        BW_I2S_TCR2_BCS(instance,0);
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : sai_hal_set_rx_bclk_swap
 * Description   : Swap the rx bit clock.
 *If the user want to swap the bit clock, just set bool variable to true. 
 *END**************************************************************************/
void sai_hal_set_rx_bclk_swap(uint8_t instance, bool ifswap)
{
    assert(instance < HW_I2S_INSTANCE_COUNT);
    if (ifswap)/* Swap the bit clock */
    {
        BW_I2S_RCR2_BCS(instance,1);
    }
    else
    {
        BW_I2S_RCR2_BCS(instance,0);
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : sai_hal_mclk_divider_is_update
 * Description   :Get the state if the master clock divider is updating.
 *
 *END**************************************************************************/
bool sai_hal_mclk_divider_is_update(uint8_t instance)
{
    assert(instance < HW_I2S_INSTANCE_COUNT);
    return BR_I2S_MCR_DUF(instance);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : sai_hal_word_start_is_detected
 * Description   : The function would tell the user if the word start bit is set.
 * The bit is set by hardware. 
 *END**************************************************************************/
bool sai_hal_word_start_is_detected(uint8_t instance, sai_io_mode_t io_mode)
{
    assert(instance < HW_I2S_INSTANCE_COUNT);
    switch (io_mode)
    {
        case kSaiIOModeTransmit:
            return BR_I2S_TCSR_WSF(instance);
            break;
        case kSaiIOModeReceive:
            return BR_I2S_RCSR_WSF(instance);
            break;
        default:
            break;
    }
    return false;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : sai_hal_sync_error_is_detected
 * Description   : The function would tell the user if the sync error bit is set. 
 * The bit is set by hardware.
 *END**************************************************************************/
bool sai_hal_sync_error_is_detected(uint8_t instance, sai_io_mode_t io_mode)
{
    assert(instance < HW_I2S_INSTANCE_COUNT);
    switch (io_mode)
    {
        case kSaiIOModeTransmit:
            return BR_I2S_TCSR_SEF(instance);
            break;
        case kSaiIOModeReceive:
            return BR_I2S_RCSR_SEF(instance);
            break;
        default:
            break;
    }
    return false;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : sai_hal_fifo_warning_is_detected
 * Description   : The function would tell the user if the fifo warning bit is set. 
 * The bit is set by hardware.
 *END**************************************************************************/
bool sai_hal_fifo_warning_is_detected(uint8_t instance, sai_io_mode_t io_mode)
{
    assert(instance < HW_I2S_INSTANCE_COUNT);
    switch (io_mode)
    {
        case kSaiIOModeTransmit:
            return BR_I2S_TCSR_FWF(instance);
            break;
        case kSaiIOModeReceive:
            return BR_I2S_RCSR_FWF(instance);
            break;
        default:
            break;
    }
    return false;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : sai_hal_fifo_error_is_detected
 * Description   : The function would tell the user if the fifo error bit is set. 
 * The bit is set by hardware.
 *END**************************************************************************/
bool sai_hal_fifo_error_is_detected(uint8_t instance, sai_io_mode_t io_mode)
{
    assert(instance < HW_I2S_INSTANCE_COUNT);
    switch (io_mode)
    {
        case kSaiIOModeTransmit:
            return BR_I2S_TCSR_FEF(instance);
            break;
        case kSaiIOModeReceive:
            return BR_I2S_RCSR_FEF(instance);
            break;
        default:
            break;
    }
    return false;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : sai_hal_fifo_request_is_detected
 * Description   : The function would tell the user if the fifo request bit is set. 
 * The bit is set by hardware.
 *END**************************************************************************/
bool sai_hal_fifo_request_is_detected(uint8_t instance, sai_io_mode_t io_mode)
{
    assert(instance < HW_I2S_INSTANCE_COUNT);
    switch (io_mode)
    {
        case kSaiIOModeTransmit:
            return BR_I2S_TCSR_FRF(instance);
            break;
        case kSaiIOModeReceive:
            return BR_I2S_RCSR_FRF(instance);
            break;
        default:
            break;
    }
    return false;
}

/******************************************************************************
*EOF
******************************************************************************/

